; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v10 ?v6)
             (pred_3 ?v13 ?v3)
             (pred_12 ?v10 ?v3)
             (pred_2 ?v1 ?v10 )
	     (pred_1 ?v10)
             (pred_11 ?v2)
             (pred_6 ?v13)
             (pred_5 ?v3)
             (pred_4 ?v10)
             (pred_9 ?v13)
             (pred_7 ?v10)
             (pred_10 ))



(:action op_2
:parameters (?v9 ?v11 ?v12 ?v7)
:precondition (and (pred_11 ?v9) (pred_11 ?v11) (pred_6 ?v12) (pred_5 ?v7)
          (pred_8 ?v9 ?v11) (pred_3 ?v12 ?v7)
                   (pred_12 ?v11 ?v7) (pred_1 ?v9) 
                   (pred_4 ?v11) (pred_9 ?v12))
:effect (and  (pred_7 ?v11) (not (pred_4 ?v11))))


(:action op_3
:parameters (?v9 ?v5)
:precondition (and (pred_11 ?v9) (pred_11 ?v5)
               (pred_1 ?v9) (pred_8 ?v9 ?v5) (pred_7 ?v5))
:effect (and (pred_1 ?v5) (not (pred_1 ?v9))))

(:action op_4
:parameters (?v9 ?v12)
:precondition (and (pred_11 ?v9) (pred_6 ?v12) 
                  (pred_1 ?v9) (pred_2 ?v12 ?v9) (pred_10 ))
:effect (and (pred_9 ?v12)
   (not (pred_2 ?v12 ?v9)) (not (pred_10 ))))


(:action op_1
:parameters (?v9 ?v4 ?v8)
:precondition (and (pred_11 ?v9) (pred_6 ?v4) (pred_6 ?v8)
                  (pred_1 ?v9) (pred_9 ?v8) (pred_2 ?v4 ?v9))
:effect (and (pred_9 ?v4) (pred_2 ?v8 ?v9)
        (not (pred_9 ?v8)) (not (pred_2 ?v4 ?v9))))

(:action op_5
:parameters (?v9 ?v12)
:precondition (and (pred_11 ?v9) (pred_6 ?v12) 
                  (pred_1 ?v9) (pred_9 ?v12))
:effect (and (pred_10 ) (pred_2 ?v12 ?v9) (not (pred_9 ?v12)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_11 obj_20 obj_06 obj_05 obj_16 obj_09 obj_08 obj_17 obj_02 obj_18 obj_21 obj_14 obj_13 obj_04 obj_19 obj_22
    obj_03 obj_01 obj_07
    obj_12 obj_10 obj_15
    )

    (:init
       (pred_10)

       (pred_11 obj_11)
       (pred_11 obj_20)
       (pred_11 obj_06)
       (pred_11 obj_05)
       (pred_11 obj_16)
       (pred_11 obj_09)
       (pred_11 obj_08)
       (pred_11 obj_17)
       (pred_11 obj_02)
       (pred_11 obj_18)
       (pred_11 obj_21)
       (pred_11 obj_14)
       (pred_11 obj_13)
       (pred_11 obj_04)
       (pred_11 obj_19)
       (pred_11 obj_22)
       (pred_5 obj_03)
       (pred_5 obj_01)
       (pred_5 obj_07)
       (pred_6 obj_12)
       (pred_6 obj_10)
       (pred_6 obj_15)

       (pred_8 obj_11 obj_16)
       (pred_8 obj_11 obj_20)
       (pred_8 obj_20 obj_09)
       (pred_8 obj_20 obj_06)
       (pred_8 obj_20 obj_11)
       (pred_8 obj_06 obj_08)
       (pred_8 obj_06 obj_05)
       (pred_8 obj_06 obj_20)
       (pred_8 obj_05 obj_17)
       (pred_8 obj_05 obj_06)
       (pred_8 obj_16 obj_02)
       (pred_8 obj_16 obj_09)
       (pred_8 obj_16 obj_11)
       (pred_8 obj_09 obj_18)
       (pred_8 obj_09 obj_08)
       (pred_8 obj_09 obj_20)
       (pred_8 obj_09 obj_16)
       (pred_8 obj_08 obj_21)
       (pred_8 obj_08 obj_17)
       (pred_8 obj_08 obj_06)
       (pred_8 obj_08 obj_09)
       (pred_8 obj_17 obj_14)
       (pred_8 obj_17 obj_05)
       (pred_8 obj_17 obj_08)
       (pred_8 obj_02 obj_13)
       (pred_8 obj_02 obj_18)
       (pred_8 obj_02 obj_16)
       (pred_8 obj_18 obj_04)
       (pred_8 obj_18 obj_21)
       (pred_8 obj_18 obj_09)
       (pred_8 obj_18 obj_02)
       (pred_8 obj_21 obj_19)
       (pred_8 obj_21 obj_14)
       (pred_8 obj_21 obj_08)
       (pred_8 obj_21 obj_18)
       (pred_8 obj_14 obj_22)
       (pred_8 obj_14 obj_17)
       (pred_8 obj_14 obj_21)
       (pred_8 obj_13 obj_04)
       (pred_8 obj_13 obj_02)
       (pred_8 obj_04 obj_19)
       (pred_8 obj_04 obj_18)
       (pred_8 obj_04 obj_13)
       (pred_8 obj_19 obj_22)
       (pred_8 obj_19 obj_21)
       (pred_8 obj_19 obj_04)
       (pred_8 obj_22 obj_14)
       (pred_8 obj_22 obj_19)
       (pred_4 obj_18)
       (pred_4 obj_02)
       (pred_4 obj_14)
       (pred_12  obj_18 obj_03)
       (pred_12  obj_02 obj_01)
       (pred_12  obj_14 obj_07)
       (pred_7 obj_11)
       (pred_7 obj_20)
       (pred_7 obj_06)
       (pred_7 obj_05)
       (pred_7 obj_16)
       (pred_7 obj_09)
       (pred_7 obj_08)
       (pred_7 obj_17)
       (pred_7 obj_21)
       (pred_7 obj_13)
       (pred_7 obj_04)
       (pred_7 obj_19)
       (pred_7 obj_22)

       (pred_3  obj_12 obj_03)
       (pred_3  obj_10 obj_01)
       (pred_3  obj_15 obj_07)
       (pred_2 obj_12 obj_06)
       (pred_2 obj_10 obj_04)
       (pred_2 obj_15 obj_09)
       (pred_1 obj_17)
    )

    (:goal (and
       (pred_2 obj_10 obj_16)
    ))
(:constraints
  (always (not (pred_1 obj_02)))
)
)

; plan
1. (op_3 obj_17 obj_08)
   deleted: (pred_1 obj_17)
   added: (pred_1 obj_08)
   goals met: 0 of 1
2. (op_3 obj_08 obj_21)
   deleted: (pred_1 obj_08)
   added: (pred_1 obj_21)
   goals met: 0 of 1
3. (op_3 obj_21 obj_19)
   deleted: (pred_1 obj_21)
   added: (pred_1 obj_19)
   goals met: 0 of 1
4. (op_3 obj_19 obj_04)
   deleted: (pred_1 obj_19)
   added: (pred_1 obj_04)
   goals met: 0 of 1
5. (op_4 obj_04 obj_10)
   deleted: (pred_2 obj_10 obj_04) (pred_10)
   added: (pred_9 obj_10)
   goals met: 0 of 1
6. (op_3 obj_04 obj_19)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_19)
   goals met: 0 of 1
7. (op_3 obj_19 obj_21)
   deleted: (pred_1 obj_19)
   added: (pred_1 obj_21)
   goals met: 0 of 1
8. (op_3 obj_21 obj_08)
   deleted: (pred_1 obj_21)
   added: (pred_1 obj_08)
   goals met: 0 of 1
9. (op_3 obj_08 obj_09)
   deleted: (pred_1 obj_08)
   added: (pred_1 obj_09)
   goals met: 0 of 1
10. (op_3 obj_09 obj_16)
   deleted: (pred_1 obj_09)
   added: (pred_1 obj_16)
   goals met: 0 of 1
11. (op_5 obj_16 obj_10)
   deleted: (pred_9 obj_10)
   added: (pred_10) (pred_2 obj_10 obj_16)
   goals met: 1 of 1
